export default function About() {
  return (
    <div>
      <h1 style={{ lineHeight: '1.3', marginBottom: '20px' }}>Про нашу еко-місію та бренд Iveco</h1>
      <p>Ми є офіційним партнером, який просуває інноваційні технології сталого розвитку компанії Iveco на ринку комерційних перевезень.</p>
      <p>Наша meta — допомогти логістичним компаніям та приватному бізнесу перейти на альтернативні види палива. Ми пропонуємо не просто вантажівки, а готову екосистему: від підбору конфігурації акумуляторів Iveco eDaily до сервісного обслуговування газових та електричних силових установок.</p>
    </div>
  );
}
